/*
SQLyog Ultimate v8.32 
MySQL - 5.1.30-community : Database - isunmoon_oa
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`isunmoon_oa` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `isunmoon_oa`;

/*Table structure for table `t_organization` */

DROP TABLE IF EXISTS `t_organization`;

CREATE TABLE `t_organization` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `description` varchar(255) DEFAULT NULL,
  `pid` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FK2163B31E77DA8C7D` (`pid`),
  CONSTRAINT `FK2163B31E77DA8C7D` FOREIGN KEY (`pid`) REFERENCES `t_organization` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=105 DEFAULT CHARSET=utf8;

/*Data for the table `t_organization` */

insert  into `t_organization`(`id`,`name`,`description`,`pid`) values (1,'组织机构1','这是组织机构1',NULL),(2,'组织机构2','这是组织机构2',NULL),(3,'组织机构3','这是组织机构3',NULL),(4,'组织机构4','这是组织机构4',NULL),(5,'组织机构5','这是组织机构5',NULL),(6,'组织机构6','这是组织机构6',NULL),(7,'组织机构7','这是组织机构7',NULL),(8,'组织机构8','这是组织机构8',NULL),(9,'组织机构9','这是组织机构9',NULL),(10,'组织机构10','这是组织机构10',NULL),(11,'组织机构11','这是组织机构11',1),(12,'组织机构12','这是组织机构12',1),(13,'组织机构13','这是组织机构13',1),(14,'组织机构14','这是组织机构14',1),(15,'组织机构15','这是组织机构15',1),(16,'组织机构16','这是组织机构16',1),(17,'组织机构17','这是组织机构17',1),(18,'组织机构18','这是组织机构18',1),(19,'组织机构19','这是组织机构19',1),(20,'组织机构21','这是组织机构21',2),(21,'组织机构22','这是组织机构22',2),(22,'组织机构23','这是组织机构23',2),(23,'组织机构24','这是组织机构24',2),(24,'组织机构25','这是组织机构25',2),(25,'组织机构26','这是组织机构26',2),(26,'组织机构27','这是组织机构27',2),(27,'组织机构28','这是组织机构28',2),(28,'组织机构29','这是组织机构29',2),(29,'组织机构31','这是组织机构31',3),(30,'组织机构32','这是组织机构32',3),(31,'组织机构33','这是组织机构33',3),(32,'组织机构34','这是组织机构34',3),(33,'组织机构35','这是组织机构35',3),(34,'组织机构36','这是组织机构36',3),(35,'组织机构37','这是组织机构37',3),(36,'组织机构38','这是组织机构38',3),(37,'组织机构39','这是组织机构39',3),(38,'组织机构41','这是组织机构41',4),(39,'组织机构42','这是组织机构42',4),(40,'组织机构43','这是组织机构43',4),(41,'组织机构44','这是组织机构44',4),(42,'组织机构45','这是组织机构45',4),(43,'组织机构46','这是组织机构46',4),(44,'组织机构47','这是组织机构47',4),(45,'组织机构48','这是组织机构48',4),(46,'组织机构49','这是组织机构49',4),(47,'组织机构51','这是组织机构51',5),(48,'组织机构52','这是组织机构52',5),(49,'组织机构53','这是组织机构53',5),(50,'组织机构54','这是组织机构54',5),(51,'组织机构55','这是组织机构55',5),(52,'组织机构56','这是组织机构56',5),(53,'组织机构57','这是组织机构57',5),(54,'组织机构58','这是组织机构58',5),(55,'组织机构59','这是组织机构59',5),(56,'组织机构61','这是组织机构61',6),(57,'组织机构62','这是组织机构62',6),(58,'组织机构63','这是组织机构63',6),(59,'组织机构64','这是组织机构64',6),(60,'组织机构65','这是组织机构65',6),(61,'组织机构66','这是组织机构66',6),(62,'组织机构67','这是组织机构67',6),(63,'组织机构68','这是组织机构68',6),(64,'组织机构69','这是组织机构69',6),(65,'组织机构71','这是组织机构71',7),(66,'组织机构72','这是组织机构72',7),(67,'组织机构73','这是组织机构73',7),(68,'组织机构74','这是组织机构74',7),(69,'组织机构75','这是组织机构75',7),(70,'组织机构76','这是组织机构76',7),(71,'组织机构77','这是组织机构77',7),(72,'组织机构78','这是组织机构78',7),(73,'组织机构79','这是组织机构79',7),(74,'组织机构81','这是组织机构81',8),(75,'组织机构82','这是组织机构82',8),(76,'组织机构83','这是组织机构83',8),(77,'组织机构84','这是组织机构84',8),(78,'组织机构85','这是组织机构85',8),(79,'组织机构86','这是组织机构86',8),(80,'组织机构87','这是组织机构87',8),(81,'组织机构88','这是组织机构88',8),(82,'组织机构89','这是组织机构89',8),(83,'组织机构91','这是组织机构91',9),(84,'组织机构92','这是组织机构92',9),(85,'组织机构93','这是组织机构93',9),(86,'组织机构94','这是组织机构94',9),(87,'组织机构95','这是组织机构95',9),(88,'组织机构96','这是组织机构96',9),(89,'组织机构97','这是组织机构97',9),(90,'组织机构98','这是组织机构98',9),(91,'组织机构99','这是组织机构99',9),(92,'组织机构101','这是组织机构101',10),(93,'组织机构102','这是组织机构102',10),(94,'组织机构103','这是组织机构103',10),(95,'组织机构104','这是组织机构104',10),(96,'组织机构105','这是组织机构105',10),(97,'组织机构106','这是组织机构106',10),(98,'组织机构107','这是组织机构107',10),(99,'组织机构108','这是组织机构108',10),(100,'组织机构109','这是组织机构109',10);

/*Table structure for table `t_person` */

DROP TABLE IF EXISTS `t_person`;

CREATE TABLE `t_person` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `sex` varchar(255) DEFAULT NULL,
  `duty` varchar(255) DEFAULT NULL,
  `birthday` datetime DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `organization` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FK785BED80BE1DC825` (`organization`),
  CONSTRAINT `FK785BED80BE1DC825` FOREIGN KEY (`organization`) REFERENCES `t_organization` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=101 DEFAULT CHARSET=utf8;

/*Data for the table `t_person` */

insert  into `t_person`(`id`,`name`,`sex`,`duty`,`birthday`,`address`,`phone`,`organization`) values (1,'无名0','女','学生NO0','2015-03-25 21:52:11','南岗区0号','100 0000 0',1),(2,'无名1','男','学生NO1','2015-03-25 21:52:11','南岗区1号','100 0000 1',1),(3,'无名2','女','学生NO2','2015-03-25 21:52:12','南岗区2号','100 0000 2',1),(4,'无名3','男','学生NO3','2015-03-25 21:52:12','南岗区3号','100 0000 3',1),(5,'无名4','女','学生NO4','2015-03-25 21:52:12','南岗区4号','100 0000 4',1),(6,'无名5','男','学生NO5','2015-03-25 21:52:12','南岗区5号','100 0000 5',1),(7,'无名6','女','学生NO6','2015-03-25 21:52:12','南岗区6号','100 0000 6',1),(8,'无名7','男','学生NO7','2015-03-25 21:52:12','南岗区7号','100 0000 7',1),(9,'无名8','女','学生NO8','2015-03-25 21:52:12','南岗区8号','100 0000 8',1),(10,'无名9','男','学生NO9','2015-03-25 21:52:12','南岗区9号','100 0000 9',1),(11,'无名10','女','学生NO10','2015-03-25 21:52:12','南岗区10号','100 0000 10',1),(12,'无名11','男','学生NO11','2015-03-25 21:52:12','南岗区11号','100 0000 11',1),(13,'无名12','女','学生NO12','2015-03-25 21:52:12','南岗区12号','100 0000 12',1),(14,'无名13','男','学生NO13','2015-03-25 21:52:12','南岗区13号','100 0000 13',1),(15,'无名14','女','学生NO14','2015-03-25 21:52:12','南岗区14号','100 0000 14',1),(16,'无名15','男','学生NO15','2015-03-25 21:52:12','南岗区15号','100 0000 15',1),(17,'无名16','女','学生NO16','2015-03-25 21:52:12','南岗区16号','100 0000 16',1),(18,'无名17','男','学生NO17','2015-03-25 21:52:12','南岗区17号','100 0000 17',1),(19,'无名18','女','学生NO18','2015-03-25 21:52:12','南岗区18号','100 0000 18',1),(20,'无名19','男','学生NO19','2015-03-25 21:52:12','南岗区19号','100 0000 19',1),(21,'无名20','女','学生NO20','2015-03-25 21:52:12','南岗区20号','100 0000 20',1),(22,'无名21','男','学生NO21','2015-03-25 21:52:12','南岗区21号','100 0000 21',1),(23,'无名22','女','学生NO22','2015-03-25 21:52:12','南岗区22号','100 0000 22',1),(24,'无名23','男','学生NO23','2015-03-25 21:52:12','南岗区23号','100 0000 23',1),(25,'无名24','女','学生NO24','2015-03-25 21:52:13','南岗区24号','100 0000 24',1),(26,'无名25','男','学生NO25','2015-03-25 21:52:13','南岗区25号','100 0000 25',1),(27,'无名26','女','学生NO26','2015-03-25 21:52:13','南岗区26号','100 0000 26',1),(28,'无名27','男','学生NO27','2015-03-25 21:52:13','南岗区27号','100 0000 27',1),(29,'无名28','女','学生NO28','2015-03-25 21:52:13','南岗区28号','100 0000 28',1),(30,'无名29','男','学生NO29','2015-03-25 21:52:13','南岗区29号','100 0000 29',1),(31,'无名30','女','学生NO30','2015-03-25 21:52:13','南岗区30号','100 0000 30',1),(32,'无名31','男','学生NO31','2015-03-25 21:52:13','南岗区31号','100 0000 31',1),(33,'无名32','女','学生NO32','2015-03-25 21:52:13','南岗区32号','100 0000 32',1),(34,'无名33','男','学生NO33','2015-03-25 21:52:13','南岗区33号','100 0000 33',1),(35,'无名34','女','学生NO34','2015-03-25 21:52:13','南岗区34号','100 0000 34',1),(36,'无名35','男','学生NO35','2015-03-25 21:52:13','南岗区35号','100 0000 35',1),(37,'无名36','女','学生NO36','2015-03-25 21:52:13','南岗区36号','100 0000 36',1),(38,'无名37','男','学生NO37','2015-03-25 21:52:13','南岗区37号','100 0000 37',1),(39,'无名38','女','学生NO38','2015-03-25 21:52:13','南岗区38号','100 0000 38',1),(40,'无名39','男','学生NO39','2015-03-25 21:52:13','南岗区39号','100 0000 39',1),(41,'无名40','女','学生NO40','2015-03-25 21:52:13','南岗区40号','100 0000 40',1),(42,'无名41','男','学生NO41','2015-03-25 21:52:13','南岗区41号','100 0000 41',1),(43,'无名42','女','学生NO42','2015-03-25 21:52:13','南岗区42号','100 0000 42',1),(44,'无名43','男','学生NO43','2015-03-25 21:52:13','南岗区43号','100 0000 43',1),(45,'无名44','女','学生NO44','2015-03-25 21:52:13','南岗区44号','100 0000 44',1),(46,'无名45','男','学生NO45','2015-03-25 21:52:13','南岗区45号','100 0000 45',1),(47,'无名46','女','学生NO46','2015-03-25 21:52:13','南岗区46号','100 0000 46',1),(48,'无名47','男','学生NO47','2015-03-25 21:52:14','南岗区47号','100 0000 47',1),(49,'无名48','女','学生NO48','2015-03-25 21:52:14','南岗区48号','100 0000 48',1),(50,'无名49','男','学生NO49','2015-03-25 21:52:14','南岗区49号','100 0000 49',1),(51,'无名50','女','学生NO50','2015-03-25 21:52:14','南岗区50号','100 0000 50',1),(52,'无名51','男','学生NO51','2015-03-25 21:52:14','南岗区51号','100 0000 51',1),(53,'无名52','女','学生NO52','2015-03-25 21:52:14','南岗区52号','100 0000 52',1),(54,'无名53','男','学生NO53','2015-03-25 21:52:14','南岗区53号','100 0000 53',1),(55,'无名54','女','学生NO54','2015-03-25 21:52:14','南岗区54号','100 0000 54',1),(56,'无名55','男','学生NO55','2015-03-25 21:52:14','南岗区55号','100 0000 55',1),(57,'无名56','女','学生NO56','2015-03-25 21:52:14','南岗区56号','100 0000 56',1),(58,'无名57','男','学生NO57','2015-03-25 21:52:14','南岗区57号','100 0000 57',1),(59,'无名58','女','学生NO58','2015-03-25 21:52:14','南岗区58号','100 0000 58',1),(60,'无名59','男','学生NO59','2015-03-25 21:52:14','南岗区59号','100 0000 59',1),(61,'无名60','女','学生NO60','2015-03-25 21:52:14','南岗区60号','100 0000 60',1),(62,'无名61','男','学生NO61','2015-03-25 21:52:14','南岗区61号','100 0000 61',1),(63,'无名62','女','学生NO62','2015-03-25 21:52:14','南岗区62号','100 0000 62',1),(64,'无名63','男','学生NO63','2015-03-25 21:52:14','南岗区63号','100 0000 63',1),(65,'无名64','女','学生NO64','2015-03-25 21:52:14','南岗区64号','100 0000 64',1),(66,'无名65','男','学生NO65','2015-03-25 21:52:14','南岗区65号','100 0000 65',1),(67,'无名66','女','学生NO66','2015-03-25 21:52:14','南岗区66号','100 0000 66',1),(68,'无名67','男','学生NO67','2015-03-25 21:52:14','南岗区67号','100 0000 67',1),(69,'无名68','女','学生NO68','2015-03-25 21:52:14','南岗区68号','100 0000 68',1),(70,'无名69','男','学生NO69','2015-03-25 21:52:14','南岗区69号','100 0000 69',1),(71,'无名70','女','学生NO70','2015-03-25 21:52:14','南岗区70号','100 0000 70',1),(72,'无名71','男','学生NO71','2015-03-25 21:52:14','南岗区71号','100 0000 71',1),(73,'无名72','女','学生NO72','2015-03-25 21:52:15','南岗区72号','100 0000 72',1),(74,'无名73','男','学生NO73','2015-03-25 21:52:15','南岗区73号','100 0000 73',1),(75,'无名74','女','学生NO74','2015-03-25 21:52:15','南岗区74号','100 0000 74',1),(76,'无名75','男','学生NO75','2015-03-25 21:52:15','南岗区75号','100 0000 75',1),(77,'无名76','女','学生NO76','2015-03-25 21:52:15','南岗区76号','100 0000 76',1),(78,'无名77','男','学生NO77','2015-03-25 21:52:15','南岗区77号','100 0000 77',1),(79,'无名78','女','学生NO78','2015-03-25 21:52:15','南岗区78号','100 0000 78',1),(80,'无名79','男','学生NO79','2015-03-25 21:52:15','南岗区79号','100 0000 79',1),(81,'无名80','女','学生NO80','2015-03-25 21:52:15','南岗区80号','100 0000 80',1),(82,'无名81','男','学生NO81','2015-03-25 21:52:15','南岗区81号','100 0000 81',1),(83,'无名82','女','学生NO82','2015-03-25 21:52:15','南岗区82号','100 0000 82',1),(84,'无名83','男','学生NO83','2015-03-25 21:52:15','南岗区83号','100 0000 83',1),(85,'无名84','女','学生NO84','2015-03-25 21:52:15','南岗区84号','100 0000 84',1),(86,'无名85','男','学生NO85','2015-03-25 21:52:15','南岗区85号','100 0000 85',1),(87,'无名86','女','学生NO86','2015-03-25 21:52:15','南岗区86号','100 0000 86',1),(88,'无名87','男','学生NO87','2015-03-25 21:52:15','南岗区87号','100 0000 87',1),(89,'无名88','女','学生NO88','2015-03-25 21:52:15','南岗区88号','100 0000 88',1),(90,'无名89','男','学生NO89','2015-03-25 21:52:15','南岗区89号','100 0000 89',1),(91,'无名90','女','学生NO90','2015-03-25 21:52:15','南岗区90号','100 0000 90',1),(92,'无名91','男','学生NO91','2015-03-25 21:52:15','南岗区91号','100 0000 91',1),(93,'无名92','女','学生NO92','2015-03-25 21:52:15','南岗区92号','100 0000 92',1),(94,'无名93','男','学生NO93','2015-03-25 21:52:15','南岗区93号','100 0000 93',1),(95,'无名94','女','学生NO94','2015-03-25 21:52:15','南岗区94号','100 0000 94',1),(96,'无名95','男','学生NO95','2015-03-25 21:52:15','南岗区95号','100 0000 95',1),(97,'无名96','女','学生NO96','2015-03-25 21:52:15','南岗区96号','100 0000 96',1),(98,'无名97','男','学生NO97','2015-03-25 21:52:16','南岗区97号','100 0000 97',1),(99,'无名98','女','学生NO98','2015-03-25 21:52:16','南岗区98号','100 0000 98',1),(100,'无名99','男','学生NO99','2015-03-25 21:52:16','南岗区99号','100 0000 99',1);

/*Table structure for table `t_role` */

DROP TABLE IF EXISTS `t_role`;

CREATE TABLE `t_role` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

/*Data for the table `t_role` */

insert  into `t_role`(`id`,`name`) values (1,'普通用户'),(2,'普通管理员'),(3,'超级管理员');

/*Table structure for table `t_user` */

DROP TABLE IF EXISTS `t_user`;

CREATE TABLE `t_user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `expireTime` datetime DEFAULT NULL,
  `person` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `person` (`person`),
  KEY `FKCB63CCB63D541FA9` (`person`),
  CONSTRAINT `FKCB63CCB63D541FA9` FOREIGN KEY (`person`) REFERENCES `t_person` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

/*Data for the table `t_user` */

insert  into `t_user`(`id`,`name`,`password`,`expireTime`,`person`) values (4,'wangliming','wangliming','2015-03-31 00:00:00',1);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
